Revit 2027 API
ExternalResourceTypes Class
Provides a container of all Revit built-in ExternalResourceType instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceTypes
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExternalResourceTypes
Public NotInheritable Class ExternalResourceTypes
public ref class ExternalResourceTypes abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceTypes = class end
See Also
Reference
Autodesk.Revit.DB Namespace